GUdaoxi/demo_qspi/LPTIM16_Timing/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33fh0xx.h
/**
  ****************************************************************************************************//**
  * @file     FM33FH0XX.h
  *
  * @brief    CMSIS M0 Peripheral Access Layer Header File for
  *           FM33FH0XX from .
  *
  * @version  V1.0
  * @date     29. December 2023
  *
  * @note     Generated with SVDConv V2.87e 
  *           from CMSIS SVD File 'FM33FH0XX.svd' Version 1.0,
  *******************************************************************************************************
  * @attention    
  * @attention
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  *
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  *******************************************************************************************************
  */


/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup FM33FH0XX
  * @{
  */

#ifndef FM33FH0XX_H
#define FM33FH0XX_H

#ifdef __cplusplus
extern "C" {
#endif


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* ---------------------  SC000 Processor Exceptions Numbers  --------------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NMI_IRQn                      = -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */
  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */                                               
  PendSV_IRQn                   =  -2,              /*!<  14  Pendable request for system service                              */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* --------------------  FM33FH0XX Specific Interrupt Numbers  -------------------- */
  MUX0_IRQn                     =   0,              /*!<   0  MUX0 interrupt                                                   */
  MUX1_IRQn                     =   1,              /*!<   1  MUX1 interrupt                                                   */
  MUX2_IRQn                     =   2,              /*!<   2  MUX2 interrupt                                                   */
  MUX3_IRQn                     =   3,              /*!<   3  MUX3 interrupt                                                   */
  MUX4_IRQn                     =   4,              /*!<   4  MUX4 interrupt                                                   */
  MUX5_IRQn                     =   5,              /*!<   5  MUX5 interrupt                                                   */
  MUX6_IRQn                     =   6,              /*!<   6  MUX6 interrupt                                                   */
  MUX7_IRQn                     =   7,              /*!<   7  MUX7 interrupt                                                   */
  MUX8_IRQn                     =   8,              /*!<   8  MUX8 interrupt                                                   */
  MUX9_IRQn                     =   9,              /*!<   9  MUX9 interrupt                                                   */
  MUX10_IRQn                    =  10,              /*!<  10  MUX10 interrupt                                                  */
  MUX11_IRQn                    =  11,              /*!<  11  MUX11 interrupt                                                  */
  MUX12_IRQn                    =  12,              /*!<  12  MUX12 interrupt                                                  */
  MUX13_IRQn                    =  13,              /*!<  13  MUX13 interrupt                                                  */
  MUX14_IRQn                    =  14,              /*!<  14  MUX14 interrupt                                                  */
  MUX15_IRQn                    =  15,              /*!<  15  MUX15 interrupt                                                  */
  MUX16_IRQn                    =  16,              /*!<  16  MUX16 interrupt                                                  */
  MUX17_IRQn                    =  17,              /*!<  17  MUX17 interrupt                                                  */
  MUX18_IRQn                    =  18,              /*!<  18  MUX18 interrupt                                                  */
  MUX19_IRQn                    =  19,              /*!<  19  MUX19 interrupt                                                  */
  MUX20_IRQn                    =  20,              /*!<  20  MUX20 interrupt                                                  */
  MUX21_IRQn                    =  21,              /*!<  21  MUX21 interrupt                                                  */
  MUX22_IRQn                    =  22,              /*!<  22  MUX22 interrupt                                                  */
  MUX23_IRQn                    =  23,              /*!<  23  MUX23 interrupt                                                  */
  MUX24_IRQn                    =  24,              /*!<  24  MUX24 interrupt                                                  */
  MUX25_IRQn                    =  25,              /*!<  25  MUX25 interrupt                                                  */
  MUX26_IRQn                    =  26,              /*!<  26  MUX26 interrupt                                                  */
  MUX27_IRQn                    =  27,              /*!<  27  MUX27 interrupt                                                  */
  MUX28_IRQn                    =  28,              /*!<  28  MUX28 interrupt                                                  */
  MUX29_IRQn                    =  29,              /*!<  29  MUX29 interrupt                                                  */
  MUX30_IRQn                    =  30,              /*!<  30  MUX30 interrupt                                                  */
  MUX31_IRQn                    =  31               /*!<  31  MUX31 interrupt                                                  */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the SC000 Processor and Core Peripherals---------------- */
#define __CM0_REV                      0x0100U      /*!< Cortex-M0 Core Revision                                               */
#define __MPU_PRESENT                  0            /*!< MPU present or not                                                    */
#define __VTOR_PRESENT                 1            /*!< VTOR present or not                                                   */
#define __NVIC_PRIO_BITS               2            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0plus.h"                           /*!< Cortex-M0 processor and core peripherals                              */
#include "system_fm33fh0xx.h"                       /*!< FM33FH0XX System                                                      */
#include <stdint.h>   

/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)             
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif



/* ================================================================================ */
/* ================                       ADC                      ================ */
/* ================================================================================ */


/**
  * @brief ADC module information (ADC)
  */

