GUdaoxi/demo_qspi/LPTIM16_Timing/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33fh0xx.h
typedef struct {                                    /*!< ADC Structure                                                         */
  __IO uint32_t  ACQ_ISR;                           /*!< ACQ_ISR Register                                                      */
  __IO uint32_t  ACQ_IER;                           /*!< ACQ_IER Register                                                      */
  __IO uint32_t  GISR;                              /*!< GISR Register                                                         */
  __IO uint32_t  GIER;                              /*!< GIER Register                                                         */
  __IO uint32_t  CR1;                               /*!< CR1 Register                                                          */
  __IO uint32_t  CR2;                               /*!< CR2 Register                                                          */
  __I  uint32_t  RESERVED;
  __IO uint32_t  CFGR1;                             /*!< CFGR1 Register                                                        */
  __IO uint32_t  CFGR2;                             /*!< CFGR2 Register                                                        */
  __I  uint32_t  RESERVED1[2];
  __IO uint32_t  OSR;                               /*!< OSR Register                                                          */
  __IO uint32_t  ACQ_SR;                            /*!< ACQ_SR Register                                                       */
  __IO uint32_t  ACQ_SACR;                          /*!< ACQ_SACR Register                                                     */
  __IO uint32_t  HLTR;                              /*!< HLTR Register                                                         */
  __IO uint32_t  AWDCR;                             /*!< AWDCR Register                                                        */
  __IO uint32_t  ACQ0_CR;                           /*!< ACQ0_CR Register                                                      */
  __IO uint32_t  ACQ1_CR;                           /*!< ACQ1_CR Register                                                      */
  __IO uint32_t  ACQ2_CR;                           /*!< ACQ2_CR Register                                                      */
  __IO uint32_t  ACQ3_CR;                           /*!< ACQ3_CR Register                                                      */
  __IO uint32_t  SCANACQ_CR;                        /*!< SCANACQ_CR Register                                                   */
  __I  uint32_t  RESERVED2[11];
  __IO uint32_t  CHISR;                             /*!< CHISR Register                                                        */
  __IO uint32_t  CHDMA_DR;                          /*!< CHDMA_DR Register                                                     */
  __IO uint32_t  CH0DR;                             /*!< CH0DR Register                                                       */
  __IO uint32_t  CH1DR;                             /*!< CH1DR Register                                                       */
  __IO uint32_t  CH2DR;                             /*!< CH2DR Register                                                       */
  __IO uint32_t  CH3DR;                             /*!< CH3DR Register                                                       */
  __IO uint32_t  CH4DR;                             /*!< CH4DR Register                                                       */
  __IO uint32_t  CH5DR;                             /*!< CH5DR Register                                                       */
  __IO uint32_t  CH6DR;                             /*!< CH6DR Register                                                       */
  __IO uint32_t  CH7DR;                             /*!< CH7DR Register                                                       */
  __IO uint32_t  CH8DR;                             /*!< CH8DR Register                                                       */
  __IO uint32_t  CH9DR;                             /*!< CH9DR Register                                                       */
  __IO uint32_t  CH10DR;                            /*!< CH10DR Register                                                      */
  __IO uint32_t  CH11DR;                            /*!< CH11DR Register                                                      */
  __IO uint32_t  CH12DR;                            /*!< CH12DR Register                                                      */
  __IO uint32_t  CH13DR;                            /*!< CH13DR Register                                                      */
  __IO uint32_t  CH14DR;                            /*!< CH14DR Register                                                      */
  __IO uint32_t  CH15DR;                            /*!< CH15DR Register                                                      */
  __IO uint32_t  CH16DR;                            /*!< CH16DR Register                                                      */
  __IO uint32_t  CH17DR;                            /*!< CH17DR Register                                                      */
  __IO uint32_t  CH18DR;                            /*!< CH18DR Register                                                      */
  __IO uint32_t  CH19DR;                            /*!< CH19DR Register                                                      */
  __IO uint32_t  CH20DR;                            /*!< CH20DR Register                                                      */
  __IO uint32_t  CH21DR;                            /*!< CH21DR Register                                                      */
  __IO uint32_t  CH22DR;                            /*!< CH22DR Register                                                      */
  __IO uint32_t  CH23DR;                            /*!< CH23DR Register                                                      */
  __IO uint32_t  CH24DR;                            /*!< CH24DR Register                                                      */
  __IO uint32_t  CH25DR;                            /*!< CH25DR Register                                                      */
  __IO uint32_t  CH26DR;                            /*!< CH26DR Register                                                      */
  __IO uint32_t  CH27DR;                            /*!< CH27DR Register                                                      */
  __IO uint32_t  CH28DR;                            /*!< CH28DR Register                                                      */
  __IO uint32_t  CH29DR;                            /*!< CH29DR Register                                                      */
  __IO uint32_t  CH30DR;                            /*!< CH30DR Register                                                      */
  __IO uint32_t  CH31DR;                            /*!< CH31DR Register                                                      */
} ADC_Type;


/* ================================================================================ */
/* ================                      ATIM                      ================ */
/* ================================================================================ */


/**
  * @brief ATIM module information (ATIM)
  */

typedef struct {                                    /*!< ATIM Structure                                                        */
  __IO uint32_t  CR1;                               /*!< CR1 Register                                                          */
  __IO uint32_t  CR2;                               /*!< CR2 Register                                                          */
  __IO uint32_t  SMCR;                              /*!< SMCR Register                                                         */
  __IO uint32_t  DIER;                              /*!< DIER Register                                                         */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __IO uint32_t  EGR;                               /*!< EGR Register                                                          */
  __IO uint32_t  CCMR1;                             /*!< CCMR1 Register                                                        */
  __IO uint32_t  CCMR2;                             /*!< CCMR2 Register                                                        */
  __IO uint32_t  CCER;                              /*!< CCER Register                                                         */
  __IO uint32_t  CNT;                               /*!< CNT Register                                                          */
  __IO uint32_t  PSC;                               /*!< PSC Register                                                          */
  __IO uint32_t  ARR;                               /*!< ARR Register                                                          */
  __IO uint32_t  RCR;                               /*!< RCR Register                                                          */
  __IO uint32_t  CCR1;                              /*!< CCR1 Register                                                         */
  __IO uint32_t  CCR2;                              /*!< CCR2 Register                                                         */
  __IO uint32_t  CCR3;                              /*!< CCR3 Register                                                         */
  __IO uint32_t  CCR4;                              /*!< CCR4 Register                                                         */
  __IO uint32_t  BDTR;                              /*!< BDTR Register                                                         */
  __IO uint32_t  CCMR3;                             /*!< CCMR3 Register                                                        */
  __IO uint32_t  CCR5;                              /*!< CCR5 Register                                                         */
  __IO uint32_t  CCR6;                              /*!< CCR6 Register                                                         */
  __IO uint32_t  ECR;                               /*!< ECR Register                                                          */
  __IO uint32_t  TISEL;                             /*!< TISEL Register                                                        */
  __IO uint32_t  AFR;                               /*!< AFR Register                                                          */
  __IO uint32_t  BRKFLAG;                           /*!< BRKFLAG Register                                                      */
  __I  uint32_t  RESERVED[37];
  __IO uint32_t  DCR;                               /*!< DCR Register                                                          */
  __IO uint32_t  DMAR;                              /*!< ATIM_DMAR Register                                                    */
} ATIM_Type;


/* ================================================================================ */
/* ================                     BSTIM16                    ================ */
/* ================================================================================ */


/**
  * @brief BSTIM16 module information (BSTIM16)
  */

typedef struct {                                    /*!< BSTIM16 Structure                                                     */
  __IO uint32_t  CR1;                               /*!< CR1 Register                                                          */
  __IO uint32_t  CR2;                               /*!< CR2 Register                                                          */
  __I  uint32_t  RESERVED;
  __IO uint32_t  IER;                               /*!< IER Register                                                         */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __IO uint32_t  EGR;                               /*!< EGR Register                                                          */
  __I  uint32_t  RESERVED1[3];
  __IO uint32_t  CNT;                               /*!< CNT Register                                                          */
  __IO uint32_t  PSC;                               /*!< PSC Register                                                          */
  __IO uint32_t  ARR;                               /*!< ARR Register                                                          */
} BSTIM16_Type;


/* ================================================================================ */
/* ================                      CANFD                     ================ */
/* ================================================================================ */


/**
  * @brief FDCAN module information (CANFD)
  */

