GUdaoxi/demo_qspi/LPTIM16_Timing/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33fh0xx.h
typedef struct {                                    /*!< CLM Structure                                                         */
  __IO uint32_t  CR;                                /*!< CR Register                                                           */
  __IO uint32_t  CFGR;                              /*!< CFGR Register                                                         */
  __IO uint32_t  CNTR;                              /*!< CNTR Register                                                         */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __IO uint32_t  CMPH;                              /*!< CMPH Register                                                         */
  __IO uint32_t  CMPL;                              /*!< CMPL Register                                                         */
  __IO uint32_t  TOCFGR;                            /*!< TOCFGR Register                                                       */
} CLM_Type;


/* ================================================================================ */
/* ================                       CMU                      ================ */
/* ================================================================================ */


/**
  * @brief CMU module information (CMU)
  */

typedef struct {                                    /*!< CMU Structure                                                         */
  __IO uint32_t  SYSCLKCR;                          /*!< SYSCLKSEL Register                                                    */
  __IO uint32_t  RCHFCR;                            /*!< RCHFCR Register                                                       */
  __IO uint32_t  RCHFTR;                            /*!< RCHFTR Register                                                       */
  __IO uint32_t  PLLCR;                             /*!< PLLCR Register                                                        */
  __IO uint32_t  RCLPCR;                            /*!< RCLPCR Register                                                       */
  __IO uint32_t  RCLPTR;                            /*!< RCLPTR Register                                                       */
  __IO uint32_t  XTLFCR;                            /*!< XTLFCR Register                                                       */
  __IO uint32_t  LSCLKSEL;                          /*!< LSCLKSEL Register                                                     */
  __IO uint32_t  XTHFCR;                            /*!< XTHFCR Register                                                       */
  __I  uint32_t  RESERVED[2];
  __IO uint32_t  IER;                               /*!< IER Register                                                          */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __IO uint32_t  PCLKCR1;                           /*!< PCLKCR1 Register                                                      */
  __IO uint32_t  PCLKCR2;                           /*!< PCLKCR2 Register                                                      */
  __IO uint32_t  PCLKCR3;                           /*!< PCLKCR3 Register                                                      */
  __IO uint32_t  PCLKCR4;                           /*!< PCLKCR4 Register                                                      */
  __IO uint32_t  OPCCR1;                            /*!< OPCCR1 Register                                                       */
  __IO uint32_t  OPCCR2;                            /*!< OPCCR2 Register                                                       */
  __IO uint32_t  OPCER1;                            /*!< OPCER1 Register                                                       */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  MPRIL;                             /*!< MPRIL Register                                                        */
  __I  uint32_t  RESERVED2[10];
  __IO uint32_t  CFDCR;                             /*!< CFDCR Register                                                        */
  __IO uint32_t  CFDER;                             /*!< CFDER Register                                                        */
} CMU_Type;


/* ================================================================================ */
/* ================                      COMP                      ================ */
/* ================================================================================ */


/**
  * @brief COMP module information (COMP)
  */

typedef struct {     
  __IO  uint32_t  CR;                               /*!< COMPCR Register                                                      */
} COMP_Type;


typedef struct {                                    /*!< COMP Structure                                                        */
  __IO uint32_t  ICR;                               /*!< ICR Register                                                          */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __IO uint32_t  BUFCR;                             /*!< BUFCR Register                                                        */
} COMP_COMMON_Type;


/* ================================================================================ */
/* ================                       CRC                      ================ */
/* ================================================================================ */


/**
  * @brief CRC module information (CRC)
  */

typedef struct {                                    /*!< CRC Structure                                                         */
  __IO uint32_t  DR;                                /*!< DR Register                                                           */
  __IO uint32_t  CR;                                /*!< CR Register                                                           */
  __IO uint32_t  LFSR;                              /*!< LFSR Register                                                         */
  __IO uint32_t  XOR;                               /*!< XOR Register                                                          */
  __I  uint32_t  RESERVED[3];
  __IO uint32_t  POLY;                              /*!< POLY Register                                                         */
} CRC_Type;


/* ================================================================================ */
/* ================                       DAC                      ================ */
/* ================================================================================ */


/**
  * @brief DAC module information (DAC)
  */

typedef struct {                                    /*!< DAC Structure                                                         */
  __IO uint32_t  CR1;                               /*!< CR1 Register                                                          */
  __IO uint32_t  CR2;                               /*!< CR2 Register                                                          */
  __IO uint32_t  CFGR;                              /*!< CFGR Register                                                         */
  __IO uint32_t  SWTRGR;                            /*!< SWTRGR Register                                                       */
  __IO uint32_t  DHR;                               /*!< DHR Register                                                          */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __IO uint32_t  IER;                               /*!< IER Register                                                          */
  __IO uint32_t  SHTR;                              /*!< SHTR Register                                                         */
} DAC_Type;


/* ================================================================================ */
/* ================                       DMA                      ================ */
/* ================================================================================ */


/**
  * @brief DMA module information (DMA)
  */

