GUdaoxi/demo_qspi/LPTIM16_Timing/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33fh0xx.h
typedef struct {                                    /*!< RMU Structure                                                         */
  __IO uint32_t  PDRCR;                             /*!< PDRCR Register                                                        */
  __I  uint32_t  RESERVED;
  __IO uint32_t  RSTCR;                             /*!< RSTCR Register                                                        */
  __IO uint32_t  SOFTRST;                           /*!< SOFTRST Register                                                      */
  __IO uint32_t  RSTFR;                             /*!< RSTFR Register                                                        */
  __IO uint32_t  PRSTEN;                            /*!< PRSTEN Register                                                       */
  __IO uint32_t  AHBRSTCR;                          /*!< AHBRSTCR Register                                                     */
  __IO uint32_t  APBRSTCR1;                         /*!< APBRSTCR1 Register                                                    */
  __IO uint32_t  APBRSTCR2;                         /*!< APBRSTCR2 Register                                                    */
} RMU_Type;


/* ================================================================================ */
/* ================                       RTC                      ================ */
/* ================================================================================ */


/**
  * @brief RTC module information (RTC)
  */

typedef struct {                                    /*!< RTC Structure                                                         */
  __IO uint32_t  WER;                               /*!< WER Register                                                          */
  __IO uint32_t  IER;                               /*!< IER Register                                                          */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __IO uint32_t  BCDSEC;                            /*!< BCDSEC Register                                                       */
  __IO uint32_t  BCDMIN;                            /*!< BCDMIN Register                                                       */
  __IO uint32_t  BCDHOUR;                           /*!< BCDHOUR Register                                                      */
  __IO uint32_t  BCDDAY;                            /*!< BCDDAY Register                                                       */
  __IO uint32_t  BCDWEEK;                           /*!< BCDWEEK Register                                                      */
  __IO uint32_t  BCDMONTH;                          /*!< BCDMONTH Register                                                     */
  __IO uint32_t  BCDYEAR;                           /*!< BCDYEAR Register                                                      */
  __IO uint32_t  ALARM;                             /*!< ALARM Register                                                        */
  __IO uint32_t  TMSEL;                             /*!< TMSEL Register                                                        */
  __IO uint32_t  ADJUST;                            /*!< ADJUST Register                                                       */
  __I  uint32_t  RESERVED[2];
  __IO uint32_t  MSECCNT;                           /*!< MSECCNT Register                                                      */
  __IO uint32_t  CR;                                /*!< CR Register                                                      */
} RTC_Type;


/* ================================================================================ */
/* ================                       SCU                      ================ */
/* ================================================================================ */


/**
  * @brief SCU module information (SCU)
  */

typedef struct {                                    /*!< SCU Structure                                                         */
  __IO uint32_t  SYSCFG;                            /*!< SYSCFG Register                                                       */
  __IO uint32_t  DBGCR;                             /*!< DBGCR Register                                                        */
  __IO uint32_t  HDFFLAG;                           /*!< HDFFLAG Register                                                      */
} SCU_Type;


/* ================================================================================ */
/* ================                      SENT                      ================ */
/* ================================================================================ */


/**
  * @brief SENT0 module information (SENT)
  */

typedef struct {                                    /*!< SENT Structure                                                        */
  __IO uint32_t  CR;                                /*!< CR Register                                                           */
  __IO uint32_t  CFGR;                              /*!< CFGR Register                                                         */
  __IO uint32_t  PSR;                               /*!< PSR Register                                                          */
  __IO uint32_t  FTR;                               /*!< FTR Register                                                          */
  __IO uint32_t  SR;                                /*!< SR Register                                                           */
  __IO uint32_t  DR;                                /*!< DR Register                                                           */
  __IO uint32_t  SYNC;                              /*!< SYNC Register                                                         */
  __IO uint32_t  RCAL;                              /*!< RCAL Register                                                         */
} SENT_Type;


/* ================================================================================ */
/* ================                       SFU                      ================ */
/* ================================================================================ */


/**
  * @brief SFU module information (SFU)
  */

typedef struct {                                    /*!< SFU Structure                                                         */
  __IO uint32_t  RAMPCR;                            /*!< RAMPCR Register                                                       */
  __IO uint32_t  RAMPSR;                            /*!< RAMPSR Register                                                       */
  __IO uint32_t  MAPCR;                             /*!< MAPCR Register                                                        */
  __IO uint32_t  MAPISR;                            /*!< MAPISR Register                                                       */
} SFU_Type;


/* ================================================================================ */
/* ================                       SPI                      ================ */
/* ================================================================================ */


/**
  * @brief SPI0 module information (SPI)
  */

typedef struct {                                    /*!< SPI Structure                                                         */
  __IO uint32_t  CR1;                               /*!< CR1 Register                                                          */
  __IO uint32_t  CR2;                               /*!< CR2 Register                                                          */
  __IO uint32_t  CR3;                               /*!< CR3 Register                                                          */
  __IO uint32_t  IER;                               /*!< IER Register                                                          */
  __IO uint32_t  ISR;                               /*!< ISR Register                                                          */
  __IO uint32_t  TXBUF;                             /*!< TXBUF Register                                                        */
  __IO uint32_t  RXBUF;                             /*!< RXBUF Register                                                        */
  __I  uint32_t  RESERVED;
  __IO uint32_t  I2SCR;                             /*!< I2SCR Register                                                        */
  __IO uint32_t  I2SPR;                             /*!< I2SPR Register                                                        */
} SPI_Type;


/* ================================================================================ */
/* ================                       SVD                      ================ */
/* ================================================================================ */


/**
  * @brief SVD module information (SVD)
  */

